import { defineStore } from 'pinia'

export const useCaseStore = defineStore('case', () => {
  const diseaseCatalog = [
    {
      name: '传染病',
      diseases: [
        '犬瘟热',
        '犬细小病毒',
        '犬传染性肝炎',
        '犬冠状病毒',
        '猫泛白细胞减少症',
        '猫病毒性病气管炎',
        '皮肤真菌感染'
      ]
    },
    {
      name: '寄生虫病',
      diseases: ['蛔虫病', '钩虫病', '绦虫病', '球虫病', '疥螨虫病', '蚤病']
    },
    {
      name: '内科',
      diseases: [
        '口炎',
        '肠炎',
        '肠便秘',
        '胰腺炎',
        '肝炎',
        '腹膜炎',
        '肛门腺炎',
        '感冒',
        '鼻炎',
        '气管支气管炎',
        '肺炎',
        '心力衰竭',
        '尿道感染',
        '尿结石',
        '膀胱炎',
        '肾炎',
        '佝偻病',
        '有机磷中毒',
        '糖尿病',
        '耳血肿',
        '中耳炎',
        '眼睑内翻',
        '结膜炎',
        '角膜炎'
      ]
    },
    {
      name: '外产科疾病',
      diseases: [
        '外伤',
        '外科感染',
        '骨折',
        '关节脱位',
        '湿疹',
        '皮炎',
        '脓皮病',
        '脱毛症',
        '趾间囊肿',
        '疝',
        '阴道炎',
        '阴道脱出',
        '子宫蓄脓',
        '难产',
        '乳房炎'
      ]
    },
    {
      name: '常用手术',
      diseases: [
        '绝育',
        '剖腹产',
        '瞬膜腺增生物切除',
        '眼球摘除',
        '立耳术',
        '断尾术'
      ]
    },
    {
      name: '免疫',
      diseases: ['犬免疫程序', '猫免疫程序']
    }
  ]
  return {
    diseaseCatalog
  }
})
